In [1]:
import pandas as pd
import numpy as np
import scipy as sp
import seaborn as sn

In [2]:
from datetime import datetime
from datetime import date
import calendar
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
data1 = pd.read_csv('pthonuberdata.csv')

In [4]:
data1.shape

(796121, 4)

In [5]:
data1.head()

       Date/Time      Lat      Lon    Base
0  7/1/2014 0:03  40.7586 -73.9706  B02512
1  7/1/2014 0:05  40.7605 -73.9994  B02512
2  7/1/2014 0:06  40.7320 -73.9999  B02512
3  7/1/2014 0:09  40.7635 -73.9793  B02512
4  7/1/2014 0:20  40.7204 -74.0047  B02512

In [7]:
data1b = data1.drop('Base',1)

In [8]:
data1b.shape

(796121, 3)

In [10]:
data2 = pd.read_csv('uber-raw-data-jul14.csv')

In [11]:
data2.head()

          Date/Time      Lat      Lon    Base
0  7/1/2014 0:03:00  40.7586 -73.9706  B02512
1  7/1/2014 0:05:00  40.7605 -73.9994  B02512
2  7/1/2014 0:06:00  40.7320 -73.9999  B02512
3  7/1/2014 0:09:00  40.7635 -73.9793  B02512
4  7/1/2014 0:20:00  40.7204 -74.0047  B02512

In [13]:
data2 = None